/*
총 7문제이며, 앞의 SELECT, FUNCTIONS, GROUPING 문제를 잘 풀어보셨다면 해당 문제도 풀 수 있을겁니다.
MySQL에서 사용할 수 있는 여러가지 함수들을 활용하고 알아보는 것이 목표입니다.
===================================================================================================
이 문제는 최대한 답안을 보지 않고 본인 스스로 풀어보시고, 가볍게 답안 확인하며 체크하시면 됩니다.
수업 내용을 검증하기 위한, 즉 문제를 위한 문제의 성향이 강하다 보니,
못 풀었다고 해서 웹 개발을 못하는 것은 아니다 보니 가벼운 마음으로 접근해주세요.
*/

/* Q1)
직원명과 주민번호를 조회하되, 주민번호 9번째 자리부터 끝까지 '*'문자로 채움.
예 : 홍길동 771120-1******
*/


/* Q2)
직원명, 직급코드, 연봉(원) 조회.
단, 연봉은 보너스 포인트가 적용된 1년치 급여임.
*/


/* Q3)
부서코드가 D5, D9인 직원들 중에서 2004년도에 입사한 직원의 사번, 사원명, 부서코드, 입사일 조회
*/


/* Q4)
직원명, 입사일, 입사한 달의 근무일수 조회.
단, 주말 포함.
*/


/* Q5)
직원명, 부서코드, 생년월일, 나이(만) 조회.
단, 생년월일은 주민번호에서 추출, 나이는 계산.
*/


/* Q6)
부서코드가 D5이면 총무부, D6이면 기획부, D9이면 영업부로 처리하여 조회.
단, 부서코드가 D5, D6, D9 인 직원의 정보만 조회.
*/


/* Q7)
직원들의 입사일로부터 각 년도별 입사 인원수를 조회.
ex) ----------------------------------------------------------
    |전체직원수   | 2001년   | 2002년   | 2003년   | 2004년  |
    ----------------------------------------------------------
*/

